In [9]:
import pandas as pd
import numpy as np

In [10]:
# bad way to multiple indexing:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pops = pd.Series(populations, index=index)
pops

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [11]:
pops[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [12]:
pops[[i for i in pops.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [13]:
# The Better Way: Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [14]:
# re-index the series with MultiIndex
pops = pops.reindex(index)
pops

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [33]:
# 
pops[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [23]:
# unstack()
pop_df = pops.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [33]:
#pop_df.stack()

In [51]:
pop2=pd.DataFrame({'total':populations},index)
pop2

                    total
state      year
California 2000  33871648
           2010  37253956
New York   2000  18976457
           2010  19378102
Texas      2000  20851820
           2010  25145561

In [35]:
# add another column
pop_df = pd.DataFrame({'total': pops,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [37]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [38]:
# Methods of MultiIndex Creation
# passing arrays to create:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.907157  0.659696
  2  0.390553  0.392888
b 1  0.277432  0.177414
  2  0.592410  0.769265

In [39]:
# passing a dictionary to create
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [27]:
# explicit MultiIndex constructor
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [41]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [42]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [28]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [31]:
# MultiIndex level names
pops.index.names = ['state', 'year']
pops

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [82]:
# index=index,columns=['total']
pop2=pd.DataFrame(populations,index) 
pop2

                        0
state      year
California 2000  33871648
           2010  37253956
New York   2000  18976457
           2010  19378102
Texas      2000  20851820
           2010  25145561

In [ ]:
# MultiIndex for columns

In [ ]:
# Consider the example:
# which is a mock-up of some (somewhat realistic) medical data:

In [37]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
index
columns = pd.MultiIndex.from_product([['Bob', 'Julia', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
columns
# mockup some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Julia         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.4  23.0  37.2  54.0  36.7
     2      57.0  37.3  41.0  38.5  54.0  39.3
2014 1      13.0  38.0  33.0  37.3  35.0  37.0
     2      47.0  37.5  33.0  37.1  48.0  36.9

In [85]:
health_data['Julia']

type          HR  Temp
year visit
2013 1      55.0  38.1
     2      47.0  36.9
2014 1      21.0  37.1
     2      45.0  38.6

In [17]:
pops

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [18]:
pops['California', 2000]

33871648

In [19]:
pops['California']

year
2000    33871648
2010    37253956
dtype: int64

In [20]:
# Partial Slicing
pops.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [21]:
pops[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [22]:
# selection based on Boolean masks:
pops[pops > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [23]:
# Selection based on fancy indexing also works:
pops[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [38]:
# Multiple indexed DataFrames
health_data

subject      Bob       Julia         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.4  23.0  37.2  54.0  36.7
     2      57.0  37.3  41.0  38.5  54.0  39.3
2014 1      13.0  38.0  33.0  37.3  35.0  37.0
     2      47.0  37.5  33.0  37.1  48.0  36.9

In [39]:
health_data['Julia', 'HR']

year  visit
2013  1        23.0
      2        41.0
2014  1        33.0
      2        33.0
Name: (Julia, HR), dtype: float64

In [42]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      40.0  37.4
     2      57.0  37.3

In [43]:
health_data.iloc[:3, :4]

subject      Bob       Julia
type          HR  Temp    HR  Temp
year visit
2013 1      40.0  37.4  23.0  37.2
     2      57.0  37.3  41.0  38.5
2014 1      13.0  38.0  33.0  37.3

In [55]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        40.0
      2        57.0
2014  1        13.0
      2        47.0
Name: (Bob, HR), dtype: float64

In [51]:
# errors
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-51-000c5cdae2b3>, line 2)

In [57]:
#
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Julia   Sue
type          HR    HR    HR
year visit
2013 1      40.0  23.0  54.0
2014 1      13.0  33.0  35.0

In [58]:
# Data Aggregations on Multi-Indices

In [59]:
# average-out the measurements in the two visits each year
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Julia          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     48.5  37.35  32.0  37.85  54.0  38.00
2014     30.0  37.75  33.0  37.20  41.5  36.95

In [67]:
data_mean.mean(axis=1, level=0)

subject     Bob   Julia     Sue
year
2013     42.925  34.925  46.000
2014     33.875  35.100  39.225